type Article = {
    id: number,
    heading: string,
    content: string
};

let articles: Article[] = [
    {
        id: 0,
        heading: "ІТ у професійній діяльності вчителя",
        content: `<p>
        <span class="tab"></span>У сучасному світі технологічних змін і зростання конкуренції 
        на ринку праці, необхідність професійного розвитку, можливість йти пліч-о-пліч з технічним 
        прогресом, рушійною силою якого вважають технічне мислення, стають вкрай необхідними умовами. 
        Підготовка високо кваліфікованого фахівця потребує впровадження нових інформаційних технологій
        навчання. Особливу актуальність у сучасних умовах інтенсивного розвитку нових інформаційних 
        технологій на базі загальної комп’ютеризації здобуває організація підготовки вчителя щодо 
        використання інформаційних технологій в професійній діяльності.<br/>
        <span class="tab"></span>Одним із пріоритетних завдань реформування освіти є підготовка педагога, 
        здатного до професійної діяльності в умовах впровадження інформаційно-комунікаційних технологій у 
        навчальний процес. Сьогодні інформаційно-комунікаційні технології, як сукупність сучасних методів 
        і засобів отримання й опрацювання даних трансформуються у важіль підвищення ефективності 
        навчально-виховного процесу та управління ним. Враховуючи вимоги сьогодення, вчитель зобов’язаний 
        засвоїти основи економічних знань, мати високу загальну культуру, володіти вміннями організаційної 
        та виховної роботи, іноземною мовою, виявляти ініціативу, бути відповідальним, прагнути до самовдосконалення 
        і самоосвіти, впроваджувати інновації, що дуже важливо, набути навичок роботи з комп’ютерною технікою.</p>`
    },
    {
        id: 1,
        heading: "ІТ-компетентність",
        content: `<p>
            <span class="tab"></span>ІТ-компетентність (інформаційно-технологічна компетентність) - 
            це здатність вчителя використовувати інформаційні і комунікаційні технології для здійснення
            інформаційної діяльності (пошуку інформації, її визначення і організації, управління і 
            аналізу, а також її створення і розповсюдження) в своїй професійній сфері. А саме:</p>
            <ul>
                <li>Здійснювати інформаційну діяльність по збору, обробці, передачі, збереженню інформаційного ресурсу;</li>
                <li>По продукуванню інформації з метою автоматизації процесів інформаційно-методичного забезпечення;</li>
                <li>Оцінювати і реалізовувати можливості електронних видань освітнього призначення і розподіленого в мережі Інтернет інформаційного ресурсу освітнього призначення;</li>
                <li>Організовувати інформаційну взаємодію між учасниками навчального процесу і інтерактивним засобом, що функціонує на базі засобів ІКТ;</li>
                <li>Створювати і використовувати психолого-педагогічні діагностичні методики контролю і оцінки рівня знань учнів, їх просування в навчанні, здійснювати навчальну діяльність з використанням засобів ІКТ в аспектах, що відображають особливості конкретного навчального предмету.</li>
            </ul>
            <p><span class="tab"></span>ІТ-компетентність заслуговує на особливу увагу тому, що саме вона дає 
                можливість особистості бути сучасною, активно діяти в інформаційному середовищі, використовувати 
                найновітніші досягнення техніки в своїй професійній діяльності. Слід відмітити, що майже всі науковці 
                виділяють цю компетентність як обов’язкову складову професійної компетентності педагога. Важливість формування 
                ІКТ грамотності населення, створення неперервної системи підвищення кваліфікації в галузі ІКТ чітко відображена в 
                Міжнародній програмі ЮНЕСКО «Інформація для всіх», оскільки саме від вчителів залежить розвиток інформаційної культури молоді.
            </p>`
    },
    {
        id: 2,
        heading: "Переваги використання ІТ в освіті",
        content: `
        <p><span class="tab"></span>Серед головних переваг ІТ можна виділити:</p>
        <ul>
            <li>Iндивідуалізація навчання;</li>
            <li>Iнтенсифікація самостійної роботи учнів;</li>
            <li>Зростання обсягу виконаних на уроці завдань;</li>
            <li>Розширення інформаційних потоків при використанні Internet.</li>
        </ul>
        <p>
            <span class="tab"></span>Підвищення мотивації та пізнавальної активності за рахунок різноманітності форм роботи, можливості включення ігрового моменту: 
            вирішиш вірно приклади - відкриєш картинку, повставляєш правильно всі букви - продвинешь ближче до мети казкового героя. 
            Комп'ютер дає вчителю нові можливості, дозволяючи разом з учнем отримувати задоволення від захопливого процесу пізнання, не 
            тільки силою уяви розсовуючи стіни шкільного кабінету, але за допомогою новітніх технологій дозволяє зануритися в яскравий 
            барвистий світ. Таке заняття викликає у дітей емоційний підйом, навіть відсталі учні охоче працюють з комп'ютером.<br/> 
            <span class="tab"></span>Інтегрування звичайного уроку з комп'ютером дозволяє вчителю перекласти частину своєї роботи на ПК, роблячи при цьому 
            процес навчання більш цікавим, різноманітним, інтенсивним. Зокрема, стає більш швидким процес запису визначень, теорем 
            та інших важливих частин матеріалу, тому що вчителю не доводиться повторювати текст кілька разів (він вивів його на екран), 
            учневі не доводиться чекати, поки вчитель повторить саме потрібний йому фрагмент.<br/>
            <span class="tab"></span>Застосування на уроці комп'ютерних тестів 
            і діагностичних комплексів дозволить вчителю за короткий час отримувати об'єктивну картину рівня засвоєння матеріалу, що 
            вивчається у всіх учнів і своєчасно його скоректувати. При цьому є можливість вибору рівня складності завдання для конкретного 
            учня. Для учня важливо те, що відразу після виконання тесту (коли ця інформація ще не втратила свою актуальність) він отримує
            об'єктивний результат із зазначенням помилок, що неможливо, наприклад, при усному опитуванні.
        </p>`
    },
    {
        id: 3,
        heading: "Існуючі недоліки та проблеми застосування ІТ",
        content: `<p>
        <span class="tab"></span>Серед наявних проблем застосування ІТ можна виділити наступні:
        </p>
        <ul>
            <li>Недостатність часу на підготовку до уроку, на якому використовуються комп'ютери;</li>
            <li>Hедостатня комп'ютерна грамотність;</li> 
            <li>У робочому графіку вчителів не відведено годин для дослідження можливостей Інтернет;</li>
            <li>Cкладно інтегрувати комп'ютер у поурочну структуру занять;</li>
            <li>Hе вистачає комп'ютерного часу на всіх, при недостатній мотивації під час роботи учні часто відволікаються на ігри, музику, перевірку характеристик ПК і т.п.</li>
        </ul>`
    },
    {
        id: 4,
        heading: "Етапи розвитку ІТ",
        content: `<p>
        <span class="tab"></span>Якщо в якості ознаки ІТ вибрати інструменти, за допомогою яких проводиться обробка інформації (інструментарій технології), то можна виділити наступні етапи її розвитку:
        <br/><span class="tab"></span><em>1-й етап (до другої половини XIX ст.) - «Ручна»</em> інформаційна технологія, інструментарій якої складали: перо, чорнильниця, книга. Комунікації здійснювалися 
        ручним способом шляхом переправки через пошту листів, пакетів, депеш. Основна мета технології - представлення інформації в потрібній формі. 
        <br/><span class="tab"></span><em>2-й етап (з кінця XIX ст.) - «Механічна»</em> технологія, оснащена більш досконалими засобами доставки пошти, інструментарій якої складали: друкарська машинка, 
        телефон, диктофон. Основна мета технології - представлення інформації в потрібній формі більш зручними засобами. 
        <br/><span class="tab"></span><em>3-й етап (40 - 60-і рр.. XX ст.) - «Електрична»</em> технологія, інструментарій якої складали: великі ЕОМ і відповідне програмне забезпечення, електричні друкарські 
        машинки, ксерокси, портативні диктофони. Основна мета інформаційної технології починає переміщатися з форми представлення інформації на формування її змісту. 
        <br/><span class="tab"></span><em>4-й етап (з початку 70-х рр..) - «Електронна»</em> технологія, основним інструментарієм якої стають великі ЕОМ і створені на їхній базі автоматизовані системи 
        управління (АСУ) і інформаційно-пошукові системи, оснащені широким спектром базових і спеціалізованих програмних комплексів. Центр ваги технології ще більш зміщується на 
        формування змістовної сторони інформації для управлінського середовища різних сфер суспільного життя, особливо на організацію аналітичної роботи. 
        <br/><span class="tab"></span><em>5-й етап (з середини 80-х рр..) - «Комп'ютерна» («нова»)</em> технологія, основним інструментарієм якої є персональний комп'ютер із широким спектром стандартних 
        програмних продуктів різного призначення. На цьому етапі відбувається процес персоналізації АСУ, що проявляється у створенні систем підтримки прийняття рішень певними 
        спеціалістами. Подібні системи мають вмонтовані елементи аналізу та штучного інтелекту для різних рівнів управління, реалізуються на персональному комп'ютері і використовують 
        телекомунікації. У зв'язку з переходом на мікропроцесорну базу істотним змінам піддаються і технічні засоби побутового, культурного та іншого призначення. 
        <br/><span class="tab"></span><em>6-й етап (тільки встановлюється) - «мережева технологія»</em> (іноді її вважають частиною комп'ютерних технологій). Починають широко використовуватися в різних галузях 
        глобальні і локальні комп'ютерні мережі. Їй пророкують в найближчому майбутньому бурхливе зростання, обумовлене популярністю її засновника - глобальної комп'ютерної мережі Internet.</p>`
    },
];

export default articles;